---

C#Visual BasicVisual C++

Revit 2024 API
---
Connector..::..GetMEPConnectorInfo Method
Connector Class See Also Send Feedback
---

Gets MEP connector information.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016

# Syntax

C#
---

    public MEPConnectorInfo GetMEPConnectorInfo()

Visual Basic
---

    Public Function GetMEPConnectorInfo As MEPConnectorInfo

Visual C++
---

    public:
    MEPConnectorInfo^ GetMEPConnectorInfo()

#### Return Value

Returns nullNothingnullptra null reference (Nothing in Visual Basic) if there is no MEP connector information associated.

# See Also

Connector Class

Autodesk.Revit.DB Namespace